Управление_пожарной_частью_/src/Documents/УстановкаНормативов/УстановкаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаНормативов</name>
  <registerRecords>InformationRegister.КонтрольныеЗначенияУпражнений</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Начальник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.ВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/InformationRegisters/КонтрольныеЗначенияУпражнений/КонтрольныеЗначенияУпражнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольныеЗначенияУпражнений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МинимальноеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Норматив</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.ВозрастныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_пожарной_частью_/src/Documents/УстановкаНормативов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр КонтрольныеЗначенияУпражнений
	Движения.КонтрольныеЗначенияУпражнений.Записывать = Истина;
	Для Каждого ТекСтрокаНормативы из Нормативы Цикл
		Движение = Движения.КонтрольныеЗначенияУпражнений.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Норматив = ТекСтрокаНормативы.Норматив;
		Движение.Оценка = ТекСтрокаНормативы.Оценка;
		Движение.ВозрастнаяГруппа = ТекСтрокаНормативы.ВозрастнаяГруппа;
		Движение.МинимальноеЗначение = ТекСтрокаНормативы.МинимальноеЗначение;
		Движение.МаксимальноеЗначение = ТекСтрокаНормативы.МаксимальноеЗначение;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
